templates/employeeperson/UpdatePerson.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">http://www.ultipro.com/services/employeeperson/IEmployeePerson/UpdatePerson</a:Action>
         <UltiProToken xmlns="http://www.ultimatesoftware.com/foundation/authentication/ultiprotoken">{{ Token }}</UltiProToken>
        <ClientAccessKey xmlns="http://www.ultimatesoftware.com/foundation/authentication/clientaccesskey">{{ ClientAccessKey }}</ClientAccessKey>
    </s:Header>
    <s:Body>
        <UpdatePerson xmlns="http://www.ultipro.com/services/employeeperson">
            <entities xmlns:b="http://www.ultipro.com/contracts"
                xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <b:Person>
                    <b:AlternateEmailAddress{% if alternative_email_address %}>{{ alternative_email_address }}</b:AlternateEmailAddress>{% else %} i:nil="true" /> {% endif %}
                    <b:EmailAddress{% if email_address %}>{{ email_address }}</b:EmailAddress>{% else %} i:nil="true" /> {% endif %}
                    <b:FirstName{% if first_name %}>{{ first_name }}</b:FirstName>{% else %} i:nil="true" /> {% endif %}
                    <b:FormerLastName{% if former_last_name %}>{{ former_last_name }}</b:FormerLastName>{% else %} i:nil="true" /> {% endif %}
                    <b:LastName{% if last_name %}>{{ last_name }}</b:LastName>{% else %} i:nil="true" /> {% endif %}
                    <b:MiddleName{% if middle_name %}>{{ middle_name }}</b:MiddleName>{% else %} i:nil="true" /> {% endif %}
                    <b:PreferredFirstName{% if preferred_first_name %}>{{ preferred_first_name }}</b:PreferredFirstName>{% else %} i:nil="true" /> {% endif %}
                    <b:Prefix{% if prefix %}>{{ prefix }}</b:Prefix>{% else %} i:nil="true" /> {% endif %}
                    <b:SSN{% if ssn %}>{{ ssn }}</b:SSN>{% else %} i:nil="true" /> {% endif %}
                    <b:SuppressSSN{% if suppress_ssn %}>{{ suppress_ssn }}</b:SuppressSSN>{% else %} i:nil="true" /> {% endif %}
                    <b:EmployeeIdentifier i:type="b:EmployeeNumberIdentifier">
                        <b:CompanyCode>{{ CompanyCode }}</b:CompanyCode>
                        <b:EmployeeNumber>{{ EmployeeIdentifier }}</b:EmployeeNumber>
                    </b:EmployeeIdentifier>
                    <b:SelfServiceProperties xmlns:c="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
                        <c:KeyValueOfstringstring>
                            <c:Key />
                            <c:Value />
                        </c:KeyValueOfstringstring>
                    </b:SelfServiceProperties>
                </b:Person>
            </entities>
        </UpdatePerson>
    </s:Body>
</s:Envelope>